; domain
; PolyCraft basic domain

(define (domain PolyCraft)

    (:requirements :strips :typing :negative-preconditions :fluents)

    (:predicates
        (have_pogo_stick)
    )
    
    (:functions
        ; Map
        (trees_in_map)

        ; Items
        (count_log_in_inventory)
        (count_planks_in_inventory)
        (count_stick_in_inventory)
        (count_sack_polyisoprene_pellets_in_inventory)
        (count_tree_tap_in_inventory)
    )

    ; Actions
    (:action GET_LOG
        :parameters ()
        :precondition (and
            (>= (trees_in_map) 1)
        )
        :effect (and
            (decrease (trees_in_map) 1)
            (increase (count_log_in_inventory) 1)
        )
    )

    (:action CRAFT_PLANK
        :parameters ()
        :precondition (and
            (>= (count_log_in_inventory) 1)
        )
        :effect (and
            (decrease (count_log_in_inventory) 1)
            (increase (count_planks_in_inventory) 4)
        )
    )

    (:action CRAFT_STICK
        :parameters ()
        :precondition (and
            (>= (count_planks_in_inventory) 2)
        )
        :effect (and
            (decrease (count_planks_in_inventory) 2)
            (increase (count_stick_in_inventory) 4)
        )
    )

    (:action CRAFT_TREE_TAP
        :parameters ()
        :precondition (and
            (>= (count_planks_in_inventory) 5)
            (>= (count_stick_in_inventory) 1)
        )
        :effect (and
            (decrease (count_planks_in_inventory) 5)
            (decrease (count_stick_in_inventory) 1)
            (increase (count_tree_tap_in_inventory) 1)
        )
    )

    (:action CRAFT_WOODEN_POGO
        :parameters ()
        :precondition (and
            (>= (count_planks_in_inventory) 2)
            (>= (count_stick_in_inventory) 4)
            (>= (count_sack_polyisoprene_pellets_in_inventory) 1)
        )
        :effect (and
            (decrease (count_planks_in_inventory) 2)
            (decrease (count_stick_in_inventory) 4)
            (decrease
                (count_sack_polyisoprene_pellets_in_inventory)
                1)
            (have_pogo_stick)
        )
    )

    (:action PLACE_TREE_TAP
        :parameters ()
        :precondition (and
            (>= (trees_in_map) 1)
            (>= (count_tree_tap_in_inventory) 1)
        )
        :effect (and
            (decrease (count_tree_tap_in_inventory) 1)
            (increase
                (count_sack_polyisoprene_pellets_in_inventory)
                1)
        )
    )

)

; problem
(define (problem instance_782)
	(:domain PolyCraft)

	(:init (= (trees_in_map) 104) (= (count_log_in_inventory) 0) (= (count_planks_in_inventory) 3) (= (count_stick_in_inventory) 0) (= (count_sack_polyisoprene_pellets_in_inventory) 0) (= (count_tree_tap_in_inventory) 0)
	)
	(:goal
		(and
			(have_pogo_stick)
		)
	)
)

; plan
1. (craft_stick)
   changed: (count_planks_in_inventory) from 3 to 1, (count_stick_in_inventory) from 0 to 4
   goals met: 0 of 1
2. (get_log)
   changed: (trees_in_map) from 104 to 103, (count_log_in_inventory) from 0 to 1
   goals met: 0 of 1
3. (craft_plank)
   changed: (count_log_in_inventory) from 1 to 0, (count_planks_in_inventory) from 1 to 5
   goals met: 0 of 1
4. (craft_tree_tap)
   changed: (count_planks_in_inventory) from 5 to 0, (count_stick_in_inventory) from 4 to 3, (count_tree_tap_in_inventory) from 0 to 1
   goals met: 0 of 1
5. (place_tree_tap)
   changed: (count_tree_tap_in_inventory) from 1 to 0, (count_sack_polyisoprene_pellets_in_inventory) from 0 to 1
   goals met: 0 of 1
6. (get_log)
   changed: (trees_in_map) from 103 to 102, (count_log_in_inventory) from 0 to 1
   goals met: 0 of 1
7. (craft_plank)
   changed: (count_log_in_inventory) from 1 to 0, (count_planks_in_inventory) from 0 to 4
   goals met: 0 of 1
8. (craft_stick)
   changed: (count_planks_in_inventory) from 4 to 2, (count_stick_in_inventory) from 3 to 7
   goals met: 0 of 1
9. (craft_wooden_pogo)
   added: (have_pogo_stick)
   changed: (count_planks_in_inventory) from 2 to 0, (count_stick_in_inventory) from 7 to 3, (count_sack_polyisoprene_pellets_in_inventory) from 1 to 0
   goals met: 1 of 1
